Revit 2024 API
DWGImportOptions Class
 The import options used by importing DWG or DXF format file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class DWGImportOptions : BaseImportOptions
Visual Basic
Public Class DWGImportOptions _
	Inherits BaseImportOptions
Visual C++
public ref class DWGImportOptions : public BaseImportOptions
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BaseImportOptions
 Autodesk.Revit.DB.DWGImportOptions
See Also
DWGImportOptions Members
Autodesk.Revit.DB Namespace